# Дана строка. Удалите из этой строки все символы @.

string = str(input())
print(string.replace('@', ''))