# Дано положительное действительное число X.
# Выведите его дробную часть.
import math

a = float(input('a: '))
print(a - int(a))   #??????????????
print(a - math.floor(a))    #??????????????
print(a % 1)      #??????????????